# print(2,4,6,8,10,12,14,16,18,20)

# i = 0
# while i <= 100:
#     if i % 2 == 0:
#         print(i)
#     i += 1

name = ""

# while name != "Лукман":
# print("Вы пришли на  танцы.")
# name = input("Вы пришли на танцы. Представьтесь!")

# while True:
#     print("Здоровенький Булы")

while True:
    name = input("Вы пришли на танцы. \
          Представьтесь!")
    if name == "Лукман":
        print("Здоровенький Булы, Лукман. \
            Мы заждались, вот ваша дама")
        break
    else:
        print("Пошел вон.Нам нужин Лукман! Возвращфйся в селуху!")
        